<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Excel Settings
    |--------------------------------------------------------------------------
    |
    | Cấu hình mặc định cho Excel trong ứng dụng Laravel của bạn
    |
    */

    'exports' => [
        /*
        |--------------------------------------------------------------------------
        | Chunk size
        |--------------------------------------------------------------------------
        |
        | Khi sử dụng FromQuery, ứng dụng sẽ truy vấn DB theo từng mảnh.
        | Đây là số lượng bản ghi trong mỗi mảnh.
        |
        */
        'chunk_size' => 1000,

        /*
        |--------------------------------------------------------------------------
        | Pre-calculate formulas during export
        |--------------------------------------------------------------------------
        */
        'pre_calculate_formulas' => false,

        /*
        |--------------------------------------------------------------------------
        | CSV Settings
        |--------------------------------------------------------------------------
        */
        'csv' => [
            'delimiter' => ',',
            'enclosure' => '"',
            'line_ending' => PHP_EOL,
            'use_bom' => false,
            'include_separator_line' => false,
            'excel_compatibility' => false,
        ],

        /*
        |--------------------------------------------------------------------------
        | Worksheet properties
        |--------------------------------------------------------------------------
        */
        'properties' => [
            'creator' => '',
            'lastModifiedBy' => '',
            'title' => '',
            'description' => '',
            'subject' => '',
            'keywords' => '',
            'category' => '',
            'manager' => '',
            'company' => '',
        ],
    ],

    'imports' => [
        /*
        |--------------------------------------------------------------------------
        | Read Only
        |--------------------------------------------------------------------------
        |
        | Khi đọc file, lá cờ chỉ đọc sẽ được thêm vào reader
        |
        */
        'read_only' => true,

        /*
        |--------------------------------------------------------------------------
        | Ignore Empty
        |--------------------------------------------------------------------------
        |
        | Khi đọc file, các dòng trống sẽ bị bỏ qua
        |
        */
        'ignore_empty' => false,

        /*
        |--------------------------------------------------------------------------
        | Heading Row Formatter
        |--------------------------------------------------------------------------
        |
        | Định dạng hàng tiêu đề của file Excel được nhập vào
        |
        */
        'heading_row' => [
            'formatter' => 'slug',
        ],

        /*
        |--------------------------------------------------------------------------
        | CSV Settings
        |--------------------------------------------------------------------------
        */
        'csv' => [
            'delimiter' => ',',
            'enclosure' => '"',
            'escape_character' => '\\',
            'contiguous' => false,
            'input_encoding' => 'UTF-8',
        ],

        /*
        |--------------------------------------------------------------------------
        | Worksheet properties
        |--------------------------------------------------------------------------
        */
        'properties' => [
            'creator' => '',
            'lastModifiedBy' => '',
            'title' => '',
            'description' => '',
            'subject' => '',
            'keywords' => '',
            'category' => '',
            'manager' => '',
            'company' => '',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Extension detector
    |--------------------------------------------------------------------------
    |
    | Cấu hình để phát hiện phần mở rộng của tệp
    |
    */
    'extension_detector' => [
        'xlsx' => 'Xlsx',
        'xlsm' => 'Xlsx',
        'xltx' => 'Xlsx',
        'xltm' => 'Xlsx',
        'xls' => 'Xls',
        'xlt' => 'Xls',
        'ods' => 'Ods',
        'ots' => 'Ods',
        'slk' => 'Slk',
        'xml' => 'Xml',
        'gnumeric' => 'Gnumeric',
        'htm' => 'Html',
        'html' => 'Html',
        'csv' => 'Csv',
        'tsv' => 'Csv',

        /*
        |--------------------------------------------------------------------------
        | PDF Extension
        |--------------------------------------------------------------------------
        |
        | Cấu hình cho phần mở rộng PDF.
        |
        */
        'pdf' => 'Dompdf',
    ],

    /*
    |--------------------------------------------------------------------------
    | Value Binder
    |--------------------------------------------------------------------------
    |
    | PhpSpreadsheet đề nghị một bộ ràng buộc giá trị để thêm vào các ô.
    |
    */
    'value_binder' => [
        'default' => \PhpOffice\PhpSpreadsheet\Cell\DefaultValueBinder::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | Cache Manager
    |--------------------------------------------------------------------------
    |
    | Cấu hình trình quản lý bộ nhớ đệm mặc định.
    |
    */
    'cache' => [
        /*
        |--------------------------------------------------------------------------
        | Default cell caching driver
        |--------------------------------------------------------------------------
        |
        | Tùy chọn: memory|cache|file
        |
        */
        'driver' => 'memory',

        /*
        |--------------------------------------------------------------------------
        | Cache Directory
        |--------------------------------------------------------------------------
        |
        | Xác định thư mục lưu trữ bộ nhớ đệm khi sử dụng driver là 'file'
        |
        */
        'dir' => storage_path('framework/cache/laravel-excel'),

        /*
        |--------------------------------------------------------------------------
        | Timestamp
        |--------------------------------------------------------------------------
        |
        | Xác định thời gian tồn tại của bộ nhớ đệm
        |
        */
        'expire' => 3600,

        /*
        |--------------------------------------------------------------------------
        | Cache store
        |--------------------------------------------------------------------------
        |
        | Nếu driver là 'cache', xác định store sẽ được sử dụng
        |
        | Nếu sử dụng Redis hoặc Memcached, bạn cần cấu hình trong file config/cache.php
        |
        */
        'store' => null,
    ],

    /*
    |--------------------------------------------------------------------------
    | Transaction Handler
    |--------------------------------------------------------------------------
    |
    | Cấu hình xử lý giao dịch khi làm việc với cơ sở dữ liệu
    |
    */
    'transactions' => [
        /*
        |--------------------------------------------------------------------------
        | Transaction Handler
        |--------------------------------------------------------------------------
        |
        | Xác định xử lý giao dịch mặc định.
        |
        */
        'handler' => 'db',

        /*
        |--------------------------------------------------------------------------
        | Transaction Options
        |--------------------------------------------------------------------------
        |
        | Xác định các tùy chọn cho giao dịch.
        |
        */
        'db' => [
            'connection' => null,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Temporary File
    |--------------------------------------------------------------------------
    |
    | Cấu hình cho tệp tạm thời
    |
    */
    'temporary_files' => [
        /*
        |--------------------------------------------------------------------------
        | Local Temporary Path
        |--------------------------------------------------------------------------
        |
        | Khi xuất và nhập tệp, chúng sẽ được lưu trữ tạm thời tại đây.
        |
        */
        'local_path' => storage_path('framework/laravel-excel'),

        /*
        |--------------------------------------------------------------------------
        | Remote Temporary Disk
        |--------------------------------------------------------------------------
        |
        | Khi xử lý Excel ở môi trường worker, chúng ta cần một ổ đĩa.
        |
        */
        'remote_disk' => null,
        'remote_prefix' => null,

        /*
        |--------------------------------------------------------------------------
        | Force Resync
        |--------------------------------------------------------------------------
        |
        | Khi cài đặt này là true, tệp tạm thời được tạo trên đĩa local và sau đó được đồng bộ
        | hóa với bất kỳ đĩa từ xa nào được định cấu hình.
        |
        */
        'force_resync_remote' => null,
    ],
];
